{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"outputs": {"Identity:0": {"name": "Identity:0"}}}, "modelTopology": {"node": [{"name": "model_2/tf.strided_slice_22/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_22/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_22/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_20/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_20/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_20/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_18/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_18/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_18/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_16/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_16/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_16/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.compat.v1.pad_10/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.nn.convolution_52/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_76/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.compat.v1.pad_11/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.nn.convolution_53/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_77/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_54/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_78/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.strided_slice_17/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_17/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_17/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.nn.convolution_55/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_79/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_56/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_80/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.concat_8/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.nn.convolution_57/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_83/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.compat.v1.pad_12/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.nn.convolution_58/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_84/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_59/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_85/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.strided_slice_19/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_19/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_19/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.nn.convolution_60/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_86/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_61/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_87/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_62/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_90/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_63/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_91/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.concat_9/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.nn.convolution_64/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_94/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.compat.v1.pad_13/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.nn.convolution_65/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_95/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_66/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_96/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.strided_slice_21/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_21/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_21/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.nn.convolution_67/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_97/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_68/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_98/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_69/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_101/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_70/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_102/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.concat_10/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.nn.convolution_71/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_105/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.compat.v1.pad_14/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.nn.convolution_72/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_106/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_73/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_107/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.strided_slice_23/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_23/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.strided_slice_23/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_2/tf.nn.convolution_74/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_108/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_75/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_109/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.concat_11/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.nn.convolution_76/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "768"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_112/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.nn.convolution_77/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_113/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.reduce_mean_2/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.compat.v1.transpose_98/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.reshape_2/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_2/tf.linalg.matmul_2/MatMul/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.__operators__.add_2/AddV2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.compat.v1.pad_10/Pad", "op": "Pad", "input": ["x", "model_2/tf.compat.v1.pad_10/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_76/Add", "op": "_FusedConv2D", "input": ["model_2/tf.compat.v1.pad_10/Pad", "model_2/tf.nn.convolution_52/convolution/filter", "model_2/tf.math.add_76/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_52/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_76/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_237/Mul", "op": "Mul", "input": ["model_2/tf.math.add_76/Add", "model_2/tf.math.sigmoid_52/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.compat.v1.pad_11/Pad", "op": "Pad", "input": ["model_2/tf.math.multiply_237/Mul", "model_2/tf.compat.v1.pad_11/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_77/Add", "op": "_FusedConv2D", "input": ["model_2/tf.compat.v1.pad_11/Pad", "model_2/tf.nn.convolution_53/convolution/filter", "model_2/tf.math.add_77/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_53/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_77/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_241/Mul", "op": "Mul", "input": ["model_2/tf.math.add_77/Add", "model_2/tf.math.sigmoid_53/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_78/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.multiply_241/Mul", "model_2/tf.nn.convolution_54/convolution/filter", "model_2/tf.math.add_78/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_54/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_78/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_245/Mul", "op": "Mul", "input": ["model_2/tf.math.add_78/Add", "model_2/tf.math.sigmoid_54/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.strided_slice_16/StridedSlice", "op": "StridedSlice", "input": ["model_2/tf.math.multiply_245/Mul", "model_2/tf.strided_slice_16/ones_like/tensor", "model_2/tf.strided_slice_16/StridedSlice/end", "model_2/tf.strided_slice_16/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "15"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_2/tf.strided_slice_17/StridedSlice", "op": "StridedSlice", "input": ["model_2/tf.math.multiply_245/Mul", "model_2/tf.strided_slice_17/ones_like/tensor", "model_2/tf.strided_slice_17/StridedSlice/end", "model_2/tf.strided_slice_17/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_2/tf.math.add_79/Add", "op": "_FusedConv2D", "input": ["model_2/tf.strided_slice_17/StridedSlice", "model_2/tf.nn.convolution_55/convolution/filter", "model_2/tf.math.add_79/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_55/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_79/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_249/Mul", "op": "Mul", "input": ["model_2/tf.math.add_79/Add", "model_2/tf.math.sigmoid_55/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_80/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.multiply_249/Mul", "model_2/tf.nn.convolution_56/convolution/filter", "model_2/tf.math.add_80/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_56/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_80/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_253/Mul", "op": "Mul", "input": ["model_2/tf.math.add_80/Add", "model_2/tf.math.sigmoid_56/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_82/Add", "op": "AddV2", "input": ["model_2/tf.strided_slice_17/StridedSlice", "model_2/tf.math.multiply_253/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.concat_8/concat", "op": "ConcatV2", "input": ["model_2/tf.strided_slice_16/StridedSlice", "model_2/tf.strided_slice_17/StridedSlice", "model_2/tf.math.add_82/Add", "model_2/tf.concat_8/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "model_2/tf.math.add_83/Add", "op": "_FusedConv2D", "input": ["model_2/tf.concat_8/concat", "model_2/tf.nn.convolution_57/convolution/filter", "model_2/tf.math.add_83/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_57/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_83/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_259/Mul", "op": "Mul", "input": ["model_2/tf.math.add_83/Add", "model_2/tf.math.sigmoid_57/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.compat.v1.pad_12/Pad", "op": "Pad", "input": ["model_2/tf.math.multiply_259/Mul", "model_2/tf.compat.v1.pad_12/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_84/Add", "op": "_FusedConv2D", "input": ["model_2/tf.compat.v1.pad_12/Pad", "model_2/tf.nn.convolution_58/convolution/filter", "model_2/tf.math.add_84/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_58/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_84/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_263/Mul", "op": "Mul", "input": ["model_2/tf.math.add_84/Add", "model_2/tf.math.sigmoid_58/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_85/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.multiply_263/Mul", "model_2/tf.nn.convolution_59/convolution/filter", "model_2/tf.math.add_85/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_59/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_85/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_267/Mul", "op": "Mul", "input": ["model_2/tf.math.add_85/Add", "model_2/tf.math.sigmoid_59/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.strided_slice_18/StridedSlice", "op": "StridedSlice", "input": ["model_2/tf.math.multiply_267/Mul", "model_2/tf.strided_slice_18/ones_like/tensor", "model_2/tf.strided_slice_18/StridedSlice/end", "model_2/tf.strided_slice_18/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "15"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_2/tf.strided_slice_19/StridedSlice", "op": "StridedSlice", "input": ["model_2/tf.math.multiply_267/Mul", "model_2/tf.strided_slice_19/ones_like/tensor", "model_2/tf.strided_slice_19/StridedSlice/end", "model_2/tf.strided_slice_19/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "7"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_2/tf.math.add_86/Add", "op": "_FusedConv2D", "input": ["model_2/tf.strided_slice_19/StridedSlice", "model_2/tf.nn.convolution_60/convolution/filter", "model_2/tf.math.add_86/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_60/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_86/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_271/Mul", "op": "Mul", "input": ["model_2/tf.math.add_86/Add", "model_2/tf.math.sigmoid_60/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_87/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.multiply_271/Mul", "model_2/tf.nn.convolution_61/convolution/filter", "model_2/tf.math.add_87/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_61/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_87/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_275/Mul", "op": "Mul", "input": ["model_2/tf.math.add_87/Add", "model_2/tf.math.sigmoid_61/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_89/Add", "op": "AddV2", "input": ["model_2/tf.strided_slice_19/StridedSlice", "model_2/tf.math.multiply_275/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_90/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.add_89/Add", "model_2/tf.nn.convolution_62/convolution/filter", "model_2/tf.math.add_90/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_62/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_90/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_281/Mul", "op": "Mul", "input": ["model_2/tf.math.add_90/Add", "model_2/tf.math.sigmoid_62/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_91/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.multiply_281/Mul", "model_2/tf.nn.convolution_63/convolution/filter", "model_2/tf.math.add_91/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_63/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_91/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_285/Mul", "op": "Mul", "input": ["model_2/tf.math.add_91/Add", "model_2/tf.math.sigmoid_63/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_93/Add", "op": "AddV2", "input": ["model_2/tf.math.add_89/Add", "model_2/tf.math.multiply_285/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.concat_9/concat", "op": "ConcatV2", "input": ["model_2/tf.strided_slice_18/StridedSlice", "model_2/tf.strided_slice_19/StridedSlice", "model_2/tf.math.add_89/Add", "model_2/tf.math.add_93/Add", "model_2/tf.concat_9/concat/axis"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "model_2/tf.math.add_94/Add", "op": "_FusedConv2D", "input": ["model_2/tf.concat_9/concat", "model_2/tf.nn.convolution_64/convolution/filter", "model_2/tf.math.add_94/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_64/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_94/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_291/Mul", "op": "Mul", "input": ["model_2/tf.math.add_94/Add", "model_2/tf.math.sigmoid_64/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.compat.v1.pad_13/Pad", "op": "Pad", "input": ["model_2/tf.math.multiply_291/Mul", "model_2/tf.compat.v1.pad_13/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_95/Add", "op": "_FusedConv2D", "input": ["model_2/tf.compat.v1.pad_13/Pad", "model_2/tf.nn.convolution_65/convolution/filter", "model_2/tf.math.add_95/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_65/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_95/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_295/Mul", "op": "Mul", "input": ["model_2/tf.math.add_95/Add", "model_2/tf.math.sigmoid_65/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_96/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.multiply_295/Mul", "model_2/tf.nn.convolution_66/convolution/filter", "model_2/tf.math.add_96/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_66/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_96/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_299/Mul", "op": "Mul", "input": ["model_2/tf.math.add_96/Add", "model_2/tf.math.sigmoid_66/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.strided_slice_20/StridedSlice", "op": "StridedSlice", "input": ["model_2/tf.math.multiply_299/Mul", "model_2/tf.strided_slice_20/ones_like/tensor", "model_2/tf.strided_slice_20/StridedSlice/end", "model_2/tf.strided_slice_20/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_2/tf.strided_slice_21/StridedSlice", "op": "StridedSlice", "input": ["model_2/tf.math.multiply_299/Mul", "model_2/tf.strided_slice_21/ones_like/tensor", "model_2/tf.strided_slice_21/StridedSlice/end", "model_2/tf.strided_slice_21/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_2/tf.math.add_97/Add", "op": "_FusedConv2D", "input": ["model_2/tf.strided_slice_21/StridedSlice", "model_2/tf.nn.convolution_67/convolution/filter", "model_2/tf.math.add_97/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_67/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_97/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_303/Mul", "op": "Mul", "input": ["model_2/tf.math.add_97/Add", "model_2/tf.math.sigmoid_67/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_98/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.multiply_303/Mul", "model_2/tf.nn.convolution_68/convolution/filter", "model_2/tf.math.add_98/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_68/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_98/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_307/Mul", "op": "Mul", "input": ["model_2/tf.math.add_98/Add", "model_2/tf.math.sigmoid_68/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_100/Add", "op": "AddV2", "input": ["model_2/tf.strided_slice_21/StridedSlice", "model_2/tf.math.multiply_307/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_101/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.add_100/Add", "model_2/tf.nn.convolution_69/convolution/filter", "model_2/tf.math.add_101/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_69/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_101/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_313/Mul", "op": "Mul", "input": ["model_2/tf.math.add_101/Add", "model_2/tf.math.sigmoid_69/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_102/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.multiply_313/Mul", "model_2/tf.nn.convolution_70/convolution/filter", "model_2/tf.math.add_102/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_70/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_102/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_317/Mul", "op": "Mul", "input": ["model_2/tf.math.add_102/Add", "model_2/tf.math.sigmoid_70/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_104/Add", "op": "AddV2", "input": ["model_2/tf.math.add_100/Add", "model_2/tf.math.multiply_317/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.concat_10/concat", "op": "ConcatV2", "input": ["model_2/tf.strided_slice_20/StridedSlice", "model_2/tf.strided_slice_21/StridedSlice", "model_2/tf.math.add_100/Add", "model_2/tf.math.add_104/Add", "model_2/tf.concat_10/concat/axis"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "model_2/tf.math.add_105/Add", "op": "_FusedConv2D", "input": ["model_2/tf.concat_10/concat", "model_2/tf.nn.convolution_71/convolution/filter", "model_2/tf.math.add_105/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_71/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_105/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_323/Mul", "op": "Mul", "input": ["model_2/tf.math.add_105/Add", "model_2/tf.math.sigmoid_71/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.compat.v1.pad_14/Pad", "op": "Pad", "input": ["model_2/tf.math.multiply_323/Mul", "model_2/tf.compat.v1.pad_14/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_106/Add", "op": "_FusedConv2D", "input": ["model_2/tf.compat.v1.pad_14/Pad", "model_2/tf.nn.convolution_72/convolution/filter", "model_2/tf.math.add_106/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_72/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_106/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_327/Mul", "op": "Mul", "input": ["model_2/tf.math.add_106/Add", "model_2/tf.math.sigmoid_72/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_107/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.multiply_327/Mul", "model_2/tf.nn.convolution_73/convolution/filter", "model_2/tf.math.add_107/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_73/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_107/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_331/Mul", "op": "Mul", "input": ["model_2/tf.math.add_107/Add", "model_2/tf.math.sigmoid_73/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.strided_slice_22/StridedSlice", "op": "StridedSlice", "input": ["model_2/tf.math.multiply_331/Mul", "model_2/tf.strided_slice_22/ones_like/tensor", "model_2/tf.strided_slice_22/StridedSlice/end", "model_2/tf.strided_slice_22/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "15"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_2/tf.strided_slice_23/StridedSlice", "op": "StridedSlice", "input": ["model_2/tf.math.multiply_331/Mul", "model_2/tf.strided_slice_23/ones_like/tensor", "model_2/tf.strided_slice_23/StridedSlice/end", "model_2/tf.strided_slice_23/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_2/tf.math.add_108/Add", "op": "_FusedConv2D", "input": ["model_2/tf.strided_slice_23/StridedSlice", "model_2/tf.nn.convolution_74/convolution/filter", "model_2/tf.math.add_108/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_2/tf.math.sigmoid_74/Sigmoid", "op": "Sigmoid", "input": ["model_2/tf.math.add_108/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.multiply_335/Mul", "op": "Mul", "input": ["model_2/tf.math.add_108/Add", "model_2/tf.math.sigmoid_74/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_2/tf.math.add_109/Add", "op": "_FusedConv2D", "input": ["model_2/tf.math.multiply_335/Mul", "model_2/tf.nn.convolution_75/convolution/filter", "model_2/tf.math.add_109/Add/y"], "device": 